export const wakaData = [
  {
    id: 1,
    text: {
      original: '秋の田の かりほの庵の 苫をあらみ わが衣手は 露にぬれつつ',
      reading:
        'あきのたの かりほのいおの とまをあらみ わがころもでは つゆにぬれつつ',
    },
    author: {
      name: '天智天皇',
      reading: 'てんちてんのう',
      era: '飛鳥時代',
    },
  },
  {
    id: 2,
    text: {
      original: '春過ぎて 夏来にけらし 白妙の衣 干すてふ 天の香具山',
      reading:
        'はるすぎて なつきにけらし しろたえの ころもほすちょう あめのかぐやま',
    },
    author: {
      name: '持統天皇',
      reading: 'じとうてんのう',
      era: '飛鳥時代',
    },
  },
  {
    id: 3,
    text: {
      original: 'あしびきの山鳥の尾のしだり尾のながながし夜をひとりかも寝む',
      reading:
        'あしびきの やまどりのをの しだりをの ながながしよを ひとりかもねむ',
    },
    author: {
      name: '柿本人麻呂',
      reading: 'かきのもとのひとまろ',
      era: '飛鳥時代',
    },
  },
  {
    id: 4,
    text: {
      original: '田子の浦に うち出でてみれば 白妙の 富士の高嶺に 雪は降りつつ',
      reading:
        'たごのうらに うちいでてみれば しろたえの ふじのたかねに ゆきはふりつつ',
    },
    author: {
      name: '山辺赤人',
      reading: 'やまべのあかひと',
      era: '飛鳥時代',
    },
  },
  {
    id: 5,
    text: {
      original: '奥山に 紅葉踏み分け 鳴く鹿の 声聞く時ぞ 秋は悲しき',
      reading:
        'おくやまに もみじふみわけ なくしかの こえきくときぞ あきはかなしき',
    },
    author: {
      name: '猿丸大夫',
      reading: 'さるまるのたいふ',
      era: '不明',
    },
  },
  {
    id: 7,
    text: {
      original: '天の原 ふりさけみれば 春日なる 三笠の山に 出でし月かも',
      reading:
        'あまのはら ふりさけみれば かすがなる みかさのやま いでしつきかも',
    },
    author: {
      name: '安倍仲麻呂',
      reading: 'あべのなかまろ',
      era: '奈良時代',
    },
  },
  {
    id: 8,
    text: {
      original: 'わが庵は 都の辰巳 しかぞ住む 世をうぢ山と 人はいふなり',
      reading:
        'わがいおは みやこのたつみ しかぞすむ よをうじやまと ひとはいふなり',
    },
    author: {
      name: '喜撰法師',
      reading: 'きせんほうし',
      era: '平安時代',
    },
  },
  {
    id: 9,
    text: {
      original:
        '花の色は 移りにけりな いたづらに わが身世にふる ながめせしまに',
      reading:
        'はなのいろは うつりにけりな いたづらに わがみよにふる ながめせしまに',
    },
    author: {
      name: '小野小町',
      reading: 'おののこまち',
      era: '平安時代',
    },
  },
  {
    id: 10,
    text: {
      original: 'これやこの 行くも帰るも 別れては 知るも知らぬも 逢坂の関',
      reading:
        'これやこの ゆくもかえるも わかれては しるもしらぬも あふさかのせき',
    },
    author: {
      name: '蝉丸',
      reading: 'せみまる',
      era: '平安時代',
    },
  },
];
